{
  "backend/main.mo": "Motoko canister implementing dating profiles, matches, chats, and permissions with full CRUD and visibility checks.",
  "feature_evidence.json": "Feature evidence report linking a navbar update to affected frontend file and components.",
  "frontend-file-summaries.txt": "List of frontend file summaries describing app structure, pages, hooks, and components.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme tokens and global styling rules.",
  "frontend/index.html": "Main HTML entry point loading PWA metadata, icons, pre-boot script, and React app.",
  "frontend/public/entry-loader.js": "Pre-boot script that disables service workers, clears caches, installs a boot watchdog, and handles global errors.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining metadata, icons, colors, and display behavior.",
  "frontend/public/offline.html": "Standalone offline fallback page with bilingual messaging and retry button.",
  "frontend/public/sw.js": "Service worker in temporary disable mode that unregisters itself and skips all caching and fetch handling.",
  "frontend/src/App.tsx": "Main app component handling routing, authentication state, profile setup flow, and page rendering based on user status and navigation.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper providing header, navigation menu, language toggle, authentication controls, and footer around page content.",
  "frontend/src/components/FatalErrorBoundary.tsx": "Error boundary that catches fatal runtime errors and displays a reload prompt with optional error details.",
  "frontend/src/components/LanguageToggle.tsx": "Dropdown control allowing users to switch between English and Nepali via the i18n provider.",
  "frontend/src/components/OfflineState.tsx": "Displays an offline alert screen when the browser is not connected to the internet.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider managing Internet Identity login, logout, stored identity loading, and login status.",
  "frontend/src/hooks/useOnlineStatus.ts": "Hook tracking browser online/offline status using window events.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for profiles, matches, likes/rejections, and messaging operations using the backend actor.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides an i18n context with language persistence in localStorage and translation lookup.",
  "frontend/src/i18n/translations.ts": "Defines English translation strings for UI text, organized by feature sections.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom CSS variables for light/dark theme and UI layout tweaks.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/Chat.tsx": "Implements a chat UI that loads messages, displays them, and allows sending new messages to a match.",
  "frontend/src/pages/Home.tsx": "Displays swipe-style profile browsing with like/pass actions and handles loading states.",
  "frontend/src/pages/InstallHelp.tsx": "Shows installation instructions for Android and iOS along with benefits of installing the app.",
  "frontend/src/pages/Matches.tsx": "Lists user matches, shows loading and empty states, and allows selecting a match to open chat.",
  "frontend/src/pages/Profile.tsx": "Provides a profile editing form that loads the caller’s data, manages local form state, and saves updates through a mutation.",
  "frontend/src/pages/Settings.tsx": "Displays language settings, account info, and logout functionality using Internet Identity and i18n.",
  "frontend/src/pages/Welcome.tsx": "Renders the landing page with app features and a login button using Internet Identity.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and clearing them from the URL/hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, animations, typography, and container settings.",
  "project_state.json": "Describes project status, architecture decisions, and known issues related to deployment, PWA behavior, and production build errors."
}