{
  "backend/main.mo": "Motoko backend defining dating profiles, matches, chats, signaling data, and profile CRUD with access‑controlled queries and updates.",
  "feature_evidence.json": "Feature evidence report listing features, related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of frontend files across the project.",
  "frontend/index.css": "Global Tailwind-based styling defining theme variables, light/dark palettes, and base element styles.",
  "frontend/index.html": "Main HTML entry loading the PWA manifest, icons, pre-boot script, and React app root.",
  "frontend/public/entry-loader.js": "Pre-boot script that disables service workers, clears caches, blocks new registrations, and provides a mount watchdog and global error handler.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, colors, display mode, and icons.",
  "frontend/public/offline.html": "Standalone offline fallback page with styled bilingual messaging and a retry button.",
  "frontend/public/sw.js": "Service worker that immediately activates, deletes all caches, unregisters itself, and bypasses fetch handling for debugging.",
  "frontend/src/App.tsx": "Main app component handling authentication, online status, navigation, mobile number gating, and match/chat flow.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing header, navigation drawer, authentication controls, language toggle, and footer around page content.",
  "frontend/src/components/FatalErrorBoundary.tsx": "Error boundary that catches fatal React errors and displays a reload prompt with optional error details.",
  "frontend/src/components/ItsAMatchModal.tsx": "Modal shown when two users match, displaying profile avatars and allowing starting a chat or continuing to swipe.",
  "frontend/src/components/LanguageToggle.tsx": "Dropdown UI to switch between English and Nepali using the i18n provider.",
  "frontend/src/components/OfflineState.tsx": "Simple offline screen showing an alert when the user has no internet connection.",
  "frontend/src/components/PhoneNumberPromptModal.tsx": "Modal prompting the user to optionally save a phone number, with save and skip actions tied to profile updates.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the current identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login state, creating AuthClient instances, and exposing identity and login helpers.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks and returns the browser’s current online/offline status using window events.",
  "frontend/src/hooks/usePendingPhoneNumber.ts": "Handles saving a pending phone number to localStorage and automatically persisting it to the user profile when available.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating profiles, matches, signaling messages, and performing like/reject actions via the backend actor.",
  "frontend/src/hooks/useVideoCall.ts": "Implements WebRTC video call setup, signaling, media handling, and call state management for chat-based calls.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language state, translation lookup, and persistence via localStorage for the app’s i18n system.",
  "frontend/src/i18n/translations.ts": "Contains English translation keys and strings used throughout the application’s UI.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, dark mode styles, and base UI rules including gradients and video element defaults.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/src/pages/Chat.tsx": "Chat screen handling messaging, scrolling, and video call states between matched users.",
  "frontend/src/pages/Home.tsx": "Displays swipe-style profile browsing with like/pass actions and loading/error states.",
  "frontend/src/pages/InstallHelp.tsx": "Provides installation instructions for Android and iOS with collapsible sections and benefits list.",
  "frontend/src/pages/Matches.tsx": "Shows list of user matches with profile previews and allows selecting a match to start chatting.",
  "frontend/src/pages/MobileNumberEntry.tsx": "Simple form for entering or skipping mobile number setup to continue onboarding.",
  "frontend/src/pages/Profile.tsx": "User profile editor loading existing data, allowing full profile updates, and saving changes.",
  "frontend/src/pages/Settings.tsx": "Renders the settings page with language selection, phone number display and editing, account info, and logout functionality using i18n and Internet Identity hooks.",
  "frontend/src/pages/Welcome.tsx": "Displays a welcome screen with feature cards and an Internet Identity login button, using i18n for text.",
  "frontend/src/utils/chatId.ts": "Computes a deterministic ChatId by sorting two principals and returning them in consistent order.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from URLs, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and container settings with plugins for typography, container queries, and animations.",
  "project_state.json": "JSON file describing the project’s overall state, requirements, known issues, and feature specifications for development planning."
}