{
  "backend/main.mo": "Motoko actor implementing dating profiles, matches, chat storage, and access‑controlled CRUD and query operations using Map stores.",
  "feature_evidence.json": "Feature evidence report listing features, affected files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for numerous frontend files for build documentation.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Main HTML entry with PWA meta tags, icons, manifest, and scripts for entry-loader and the React app.",
  "frontend/public/entry-loader.js": "Pre-boot script that unregisters service workers, clears caches, blocks new registrations, and installs a boot watchdog.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, display mode, and installable icons.",
  "frontend/public/offline.html": "Standalone offline fallback page with bilingual text, styled layout, and retry button.",
  "frontend/public/sw.js": "Service worker in temporary disable mode that clears caches, unregisters itself, and avoids intercepting fetch requests.",
  "frontend/src/App.tsx": "Main app component handling authentication, routing between pages, and profile-loading logic.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper providing header, navigation menu, language switcher, and authentication controls.",
  "frontend/src/components/FatalErrorBoundary.tsx": "Error boundary component that catches fatal errors and shows a reload prompt with error details.",
  "frontend/src/components/LanguageToggle.tsx": "Dropdown toggle for switching app language between English and Nepali.",
  "frontend/src/components/OfflineState.tsx": "Displays an offline warning message when the user has no internet connection.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context including login, logout, and identity state handling.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using event listeners.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, matches, messages, and actions like liking or sending messages through the actor.",
  "frontend/src/i18n/I18nProvider.tsx": "Implements language state, persistence, and translation lookup for the app.",
  "frontend/src/i18n/translations.ts": "Defines English UI text strings for the app, covering navigation, auth, onboarding, profiles, matches, chat, and install help.",
  "frontend/src/index.css": "Sets global Tailwind styles, CSS variables for light/dark themes, and base UI behaviors like smoothing and safe-area padding.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/Chat.tsx": "Implements the chat UI, loading messages, sending new messages, and rendering conversation threads with auto-scrolling.",
  "frontend/src/pages/Home.tsx": "Displays swipe-style profile discovery with like/pass actions, loading states, and completion messaging.",
  "frontend/src/pages/InstallHelp.tsx": "Renders install instructions for Android and iOS along with benefits of installing the app.",
  "frontend/src/pages/Matches.tsx": "Shows the user's matches with avatars and basic info, handling loading and empty states.",
  "frontend/src/pages/Profile.tsx": "Profile editor page that loads the caller’s dating profile, populates a form, and saves updates via mutation.",
  "frontend/src/pages/Settings.tsx": "Settings page showing language options, account info, and logout functionality using Internet Identity.",
  "frontend/src/pages/Welcome.tsx": "Welcome/landing page displaying app features and providing a login button using Internet Identity.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Project metadata describing app goals, architecture notes, known issues, and required PWA image assets."
}