{
  "kind": "build_request",
  "title": "Add mobile-number first screen, store as username, fix overlay, apply orange/pink background",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make the first screen shown on initial app load a dedicated mobile-number entry page with an input and two actions: “Continue” (save number) and “Skip” (do not save). Do not show the main app content or the menu button until the user chooses Continue or Skip.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "when  opening web page, first it should show the mobile no entering or skip option. then after mobile enter or skip then only go to next page  where there is menu button"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh session, the first UI is a mobile-number entry screen with an input, a Continue button, and a Skip button.",
        "Before Continue/Skip, the existing authenticated pages (Home/Matches/Chat/Profile/Settings) are not visible and the menu button is not available.",
        "After Continue or Skip, the app transitions to the existing main experience and the menu button is available (via the existing AppLayout).",
        "The choice (Continue/Skip) is remembered for the current session so the first screen does not reappear on every navigation within the app."
      ]
    },
    {
      "id": "REQ-2",
      "text": "When the user enters a mobile number on the first screen, persist it so it can be used as the user’s username by saving it into the caller’s profile phone number field (DatingProfile.phoneNumber). If the user is not yet authenticated or does not yet have a profile at the time of entry, store the number locally and apply it automatically to the profile as soon as saving the caller profile becomes possible.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "store mobile number for using as username ."
        ]
      },
      "acceptanceCriteria": [
        "After entering a number and continuing, the number is persisted (not lost on refresh after authentication/profile save) and appears as the user’s stored phone number in Settings/Profile (where phone number is displayed today).",
        "If the user skips, no phone number is saved/overwritten.",
        "The app does not crash or trap if the user enters a number before authentication or before a profile exists; the number is queued locally and saved once a profile save is possible.",
        "Backend continues to protect phoneNumber privacy exactly as it does today for other users (e.g., not exposed in getProfiles unless matched)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "After completing the mobile-number entry (Continue or Skip), show the exact same “next page” content that the app currently shows (no removal of existing features/content), including the existing menu button and navigation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "next page should show   everything that currently showing"
        ]
      },
      "acceptanceCriteria": [
        "After Continue/Skip, the user sees the same main app UI and pages as before this change (Home, Matches, Chat, Profile, Settings, etc.).",
        "The header menu button is present and functional on the main app pages as it is today."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Remove/fix the persistent web-page overlay so that no unintended transparent/blur overlay blocks interaction after the menu is closed. Specifically, ensure that any overlay used for the menu only exists while the menu is open and is fully removed/disabled when closed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "still overlay in web page."
        ]
      },
      "acceptanceCriteria": [
        "With the menu closed, there is no full-screen overlay element intercepting clicks or causing blur.",
        "Opening the menu may show an overlay/backdrop, but it disappears immediately and completely once the menu is closed.",
        "Users can interact with the page normally after closing the menu (no click-blocking layer remains)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Apply an orange-and-pink background theme across the entire app (all pages, including the first mobile-number screen and the existing main pages). The background should clearly show orange and pink (e.g., a gradient) and remain consistent across navigation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "PLease make web page with color( orange and pink)",
          "entire app background with color"
        ]
      },
      "acceptanceCriteria": [
        "All pages have an orange/pink background (not just a single section).",
        "The background remains consistent when navigating between pages and when opening/closing the menu.",
        "Text and cards remain readable against the new background (no severe contrast issues that make content unusable)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not edit any files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing text introduced or modified by this change."
  ],
  "nonGoals": [
    "Implementing third-party authentication (only Internet Identity is supported).",
    "Adding new database/storage services outside the canister state and browser storage.",
    "Changing the existing main-page feature set beyond gating it behind the initial mobile-number step."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}