{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Mobile-number first-run gate, queued phone persistence, overlay fix, and orange/pink background theme",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a mobile-number entry first screen on initial load that gates the main app until Continue or Skip is chosen (remembered for the session).",
      "acceptanceCriteria": [
        "On a fresh session, the first UI is a mobile-number entry screen with an input, a Continue button, and a Skip button.",
        "Before Continue/Skip, the existing authenticated pages (Home/Matches/Chat/Profile/Settings) are not visible and the menu button is not available.",
        "After Continue or Skip, the app transitions to the existing main experience and the menu button is available (via the existing AppLayout).",
        "The choice (Continue/Skip) is remembered for the current session so the first screen does not reappear on every navigation within the app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MobileNumberEntry.tsx",
          "operation": "create",
          "description": "Create a dedicated mobile-number entry screen with a phone input and two actions (Continue/Skip). Use shadcn-ui form primitives (e.g., Card/Input/Button/Label) to keep styling consistent. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the mobile-number entry screen as the first rendered UI in a fresh session (before AppLayout), and persist a session flag (e.g., in sessionStorage) so the screen is only shown until Continue/Skip is chosen."
        },
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add English user-facing strings for the new mobile-number entry screen (and ensure other languages have safe fallbacks while keeping any newly introduced/modified user-facing text in English)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Persist entered mobile number and apply it to the caller profile phoneNumber when possible; queue locally if profile save is not yet available and do nothing on Skip.",
      "acceptanceCriteria": [
        "After entering a number and continuing, the number is persisted (not lost on refresh after authentication/profile save) and appears as the user’s stored phone number in Settings/Profile (where phone number is displayed today).",
        "If the user skips, no phone number is saved/overwritten.",
        "The app does not crash or trap if the user enters a number before authentication or before a profile exists; the number is queued locally and saved once a profile save is possible.",
        "Backend continues to protect phoneNumber privacy exactly as it does today for other users (e.g., not exposed in getProfiles unless matched)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePendingPhoneNumber.ts",
          "operation": "create",
          "description": "Add a small hook that manages a locally queued phone number (e.g., localStorage) and, when authentication + caller profile saving is possible, updates the caller profile phoneNumber via existing profile-save hooks; then clears the queued value. Ensure Skip never enqueues anything."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Invoke the pending-phone-number hook at the app level so queued numbers are applied automatically once the actor/profile is available, without affecting navigation or causing crashes."
        },
        {
          "path": "frontend/src/pages/MobileNumberEntry.tsx",
          "operation": "modify",
          "description": "On Continue, validate/trim and store the entered number locally for later application to the profile; on Skip, mark the gate complete without storing anything."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "After Continue/Skip, show the existing main app content unchanged with the existing AppLayout and menu navigation available.",
      "acceptanceCriteria": [
        "After Continue/Skip, the user sees the same main app UI and pages as before this change (Home, Matches, Chat, Profile, Settings, etc.).",
        "The header menu button is present and functional on the main app pages as it is today."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure that after the mobile-number gate completes, rendering falls through to the existing routing/page logic and uses AppLayout exactly as before (no removal of existing pages or features)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Fix the menu overlay so no transparent/blur layer remains after the menu closes; overlay/backdrop should only exist while open.",
      "acceptanceCriteria": [
        "With the menu closed, there is no full-screen overlay element intercepting clicks or causing blur.",
        "Opening the menu may show an overlay/backdrop, but it disappears immediately and completely once the menu is closed.",
        "Users can interact with the page normally after closing the menu (no click-blocking layer remains)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Remove or refactor the custom full-screen overlay so it cannot persist after the Sheet closes (prefer relying on the shadcn-ui Sheet's own backdrop behavior rather than maintaining a separate fixed overlay). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Apply an orange-and-pink background theme across the entire app (including the first mobile-number screen) with readable content.",
      "acceptanceCriteria": [
        "All pages have an orange/pink background (not just a single section).",
        "The background remains consistent when navigating between pages and when opening/closing the menu.",
        "Text and cards remain readable against the new background (no severe contrast issues that make content unusable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Implement a global orange/pink background treatment (e.g., a gradient applied to the document/body with fixed attachment for consistency) and adjust theme variables if needed to preserve readability for text and surfaces."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Adjust layout surface classes (root wrapper/header/footer) so the new global orange/pink background remains visible and consistent across navigation, while keeping header/footer content readable."
        },
        {
          "path": "frontend/src/pages/MobileNumberEntry.tsx",
          "operation": "modify",
          "description": "Ensure the first-run mobile-number screen visually matches the orange/pink app background and maintains legible typography and input/button contrast using shadcn-ui components. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}