{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix createActor options warning and desktop Navbar menu visibility",
  "requirements": [
    {
      "id": "REQ-39",
      "summary": "Ensure actor creation passes only one of `agent` or `agentOptions` to eliminate the createActor warning while preserving authenticated identity usage.",
      "acceptanceCriteria": [
        "When loading the live production build, the browser console no longer logs `Detected both agent and agentOptions passed to createActor...` during normal app startup/authenticated usage.",
        "Authenticated users still create an actor that uses the logged-in Internet Identity `identity` (no regression in login-required flows)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Update the authenticated actor creation logic so it does not provide both `agent` and `agentOptions` to the underlying actor factory; keep the Internet Identity `identity` wired into the created actor and preserve the existing access-control initialization behavior."
        },
        {
          "path": "frontend/src/config.ts",
          "operation": "modify",
          "description": "Adjust `createActorWithConfig` (or the actor factory exported from this module) to avoid constructing/passing an explicit `agent` when `agentOptions` are supplied (or vice versa), ensuring only one is forwarded to the underlying `createActor` implementation for both anonymous and authenticated flows."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Show a desktop-visible top-right menu icon in the global Navbar header that opens the existing right-side navigation sheet.",
      "acceptanceCriteria": [
        "On desktop viewport widths, the header shows a menu (hamburger) icon on the top-right.",
        "Clicking the menu icon opens the right-side navigation sheet and navigation items work as before.",
        "On mobile viewport widths, the menu icon still works and the navigation sheet still opens correctly (no regression)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Update the header layout so the menu (hamburger) icon is visible on desktop (remove the desktop-only hiding) and remains positioned at the top-right; continue using the existing shadcn-ui Sheet (Sheet/SheetTrigger/SheetContent) right-side navigation drawer for all viewport sizes. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}